; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-1-2-2)
	(:domain driverlog)
	(:objects
	driver1 - driver
	truck1 - truck
	truck2 - truck
	package1 - obj
	package2 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-3 - location
	p1-2 - location
	p1-4 - location
	p2-0 - location
	p3-2 - location
	)
	(:init
	(at driver1 s2)
	(at truck1 s4)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at package1 s4)
	(at package2 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(link s0 s1)
	(link s1 s0)
	(link s2 s0)
	(link s0 s2)
	(link s2 s1)
	(link s1 s2)
	(link s2 s3)
	(link s3 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s4)
	(link s4 s3)
	(link s4 s1)
	(link s1 s4)
	(link s4 s2)
	(link s2 s4)
)
	(:goal (and
	(at driver1 s4)
	(at truck2 s1)
	(at package1 s3)
	(at package2 s3)
	))


)

; plan
1. (load-truck package2 truck2 s2)
   deleted: (at package2 s2)
   added: (in package2 truck2)
   goals met: 0 of 4
2. (board-truck driver1 truck2 s2)
   deleted: (at driver1 s2) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 0 of 4
3. (drive-truck truck2 s2 s4 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   goals met: 0 of 4
4. (load-truck package1 truck2 s4)
   deleted: (at package1 s4)
   added: (in package1 truck2)
   goals met: 0 of 4
5. (drive-truck truck2 s4 s3 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   goals met: 0 of 4
6. (unload-truck package1 truck2 s3)
   deleted: (in package1 truck2)
   added: (at package1 s3)
   goals met: 1 of 4
7. (unload-truck package2 truck2 s3)
   deleted: (in package2 truck2)
   added: (at package2 s3)
   goals met: 2 of 4
8. (drive-truck truck2 s3 s0 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   goals met: 2 of 4
9. (drive-truck truck2 s0 s1 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 3 of 4
10. (disembark-truck driver1 truck2 s1)
   deleted: (driving driver1 truck2)
   added: (at driver1 s1) (empty truck2)
   goals met: 3 of 4
11. (walk driver1 s1 p1-4)
   deleted: (at driver1 s1)
   added: (at driver1 p1-4)
   goals met: 3 of 4
12. (walk driver1 p1-4 s4)
   deleted: (at driver1 p1-4)
   added: (at driver1 s4)
   goals met: 4 of 4
